HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxIom_regdef.h
/** \\brief  IOM Kernel Reset Status Clear Register */
typedef struct _Ifx_IOM_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_IOM_KRSTCLR_Bits;

/** \\brief  IOM Logic Analyzer Module Configuration Register */
typedef struct _Ifx_IOM_LAMCFG_Bits
{
    unsigned int IVR:1;                     /**< \brief [0:0] Invert Reference LAM block m (rw) */
    unsigned int IVM:1;                     /**< \brief [1:1] Invert Monitor LAM block m (rw) */
    unsigned int MOS:1;                     /**< \brief [2:2] Monitor Source Select LAM block m (rw) */
    unsigned int RMS:1;                     /**< \brief [3:3] Runmode Select LAM block m (rw) */
    unsigned int EWS:1;                     /**< \brief [4:4] Event Window Select LAM block m (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int EDS:4;                     /**< \brief [11:8] Event Window Active Edge Selection LAM block m (rw) */
    unsigned int IVW:1;                     /**< \brief [12:12] Invert Event Window LAM block m (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int MCS:4;                     /**< \brief [19:16] Monitor Input Signal Selection LAM block m (rw) */
    unsigned int RCS:4;                     /**< \brief [23:20] Reference Input Signal Selection LAM block m (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_IOM_LAMCFG_Bits;

/** \\brief  IOM Logic Analyzer Module Event Window Count Status Register */
typedef struct _Ifx_IOM_LAMEWC_Bits
{
    unsigned int CNT:24;                    /**< \brief [23:0] Event Window Count Value LAM block m (r) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_IOM_LAMEWC_Bits;

/** \\brief  IOM Logic Analyzer Module Event Window Configuration Register */
typedef struct _Ifx_IOM_LAMEWS_Bits
{
    unsigned int THR:24;                    /**< \brief [23:0] Event Window Count Threshold (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_IOM_LAMEWS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Iom_union
 * \{  */

/** \\brief  IOM Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_ACCEN0_Bits B;
} Ifx_IOM_ACCEN0;

/** \\brief  IOM Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_ACCEN1_Bits B;
} Ifx_IOM_ACCEN1;

/** \\brief  IOM Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_CLC_Bits B;
} Ifx_IOM_CLC;

/** \\brief  IOM Event Combiner Module Counter Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_ECMCCFG_Bits B;
} Ifx_IOM_ECMCCFG;

/** \\brief  IOM Event Combiner Module Event Trigger History Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_ECMETH0_Bits B;
} Ifx_IOM_ECMETH0;

/** \\brief  IOM Event Combiner Module Event Trigger History Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_ECMETH1_Bits B;
} Ifx_IOM_ECMETH1;

/** \\brief  IOM Event Combiner Module Global Event Selection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_ECMSELR_Bits B;
} Ifx_IOM_ECMSELR;

/** \\brief  IOM Filter and Prescaler Cell Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_FPCCTR_Bits B;
} Ifx_IOM_FPCCTR;

/** \\brief  IOM Filter and Prescaler Cells Rising & Falling Edge Status
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_FPCESR_Bits B;
} Ifx_IOM_FPCESR;

/** \\brief  IOM Filter and Prescaler Cell Timer Register k */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_FPCTIM_Bits B;
} Ifx_IOM_FPCTIM;

/** \\brief  IOM GTM Input EXOR Combiner Selection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_GTMEXR_Bits B;
} Ifx_IOM_GTMEXR;

/** \\brief  IOM Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_ID_Bits B;
} Ifx_IOM_ID;

/** \\brief  IOM Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_KRST0_Bits B;
} Ifx_IOM_KRST0;

/** \\brief  IOM Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_IOM_KRST1_Bits B;
} Ifx_IOM_KRST1;

